[{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQFkk70Se2omLA/company-logo_100_100/0/1519856500263?e=1641427200&v=beta&t=KFI74gRmaGuKbxMxga4NYu5Ooi1ZLRE3wXD99uWF_kw",
    "link": "https://www.linkedin.com/jobs/view/2744238841/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=C3R1oH0pE%2Fngk4boGEGv%2FA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Overview\n\nWe are not just offering a job but a meaningful career! Come join our passionate team!\n\nAs a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.\n\nWe offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!\n\nVisit our Careers page for more information on our benefits , locations and the process of joining the State Farm team!\n\nResponsibilities\n\nThe Access Management Framework and API team within Target WebPaaS (TWP) product suite is seeking a fulltime entry-level Software Developer. This team is involved in building and maintaining the frameworks used in applications to do authentication, authorization, and single sign-on capabilities within State Farm's internal clouds.\n\nThis position will be building solutions, capabilities, and automation to improve and manage the frameworks, services, and APIs utilizing software engineering principles.\n\nSome responsibilities include:\n\n· Applies a thorough knowledge of industry leading development skills, tools, processes, applications, environments, and programming language(s) to complete assignments\n\n· Designs and develops full-stack applications using industry-adopted languages and frameworks\n\n· Assists other developers on completing their assignments\n\n· Diagnoses and resolves complex problems/issues and completes complex assignments\n\n· Applies depth or breadth of knowledge regarding technology trends/changes, best practices, and processes to complete assignments and influence the direction of product solutions\n\n· May take on several simultaneous work stories or focus on a single complex story\n\n· Understands, supports, and helps define the vision and direction for the product development\n\nQualifications\n\nCompetitive candidates will bring the following required skills:\n\n· Learning agility and willingness to study and adopt new technologies.\n\n· Proficiency using Java specifically with Spring/Spring Boot experience, and/or Golang\n\n· Ability to develop, deploy, and support solutions in an agile DevOps organization.\n\n· Automated CI/CD\n\n· Recent graduates with internship or other experiences are encouraged to apply\n\nPreferred Qualifications/Skills include:\n\n· Experience using open-source libraries\n\n· Experience with GitOps Identity and Access Management (IAM) experience, knowledge, or certifications\n\n**Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity**\n\nSFARM\n\n\n\nPM18",
    "title": "Software Developer - Java"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQFCWOGeLQjLKQ/company-logo_100_100/0/1633042591019?e=1641427200&v=beta&t=Sr5DrhtwKPOIPYKoPw1L1d8DGRfUw2uLdajqy66HoaY",
    "link": "https://www.linkedin.com/jobs/view/2743878359/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=RWmqodY0KRs0exaOFIZ16w%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Vision\nThe convergence of laboratory automation, high-throughput assays, and machine learning is moving the medium of biological discovery to silicon. At LatchBio, our mission is to foster this revolution by creating a first-in-class platform that enables biologists to leverage the explosion of data that increases by orders of magnitude every year. Currently, biotechs waste huge sums of resources building data warehouses, analytical tools, and bioinformatic pipelines -- effectively reinventing the wheel each time. We will accelerate what is possible and solve this drain by building and disseminating the data infrastructure of the biocomputing revolution, making medicine and biotech move faster. We believe life-saving therapies are hidden within unmade connections in disparate data centers and are pushing toward a future where every idle CPU is used to uncover these links.\n\nResposibilities\nWork with a team of software engineers to design / implement flexible multi-omics pipelines.\nDesing and implement features in Python, AWS, Javascript.\nIdentify pain-points in existing -omics data pipelines & implement new methods to hit benchmarked improvements.\nDevelop statistical and visualization tools for experimental QC and high throughput data mining and analysis.\n\nThis job might be a great fit if you\nThrive in a fast-paced, collaborative, team-oriented startup environment.\nWant to take on responsibility & lead the design of highly-impactful products.\nHave experience in applying software engineering best practices to fields related to computational biology, bioinformatics, genetics. We are open to hiring at different experience levels.\nHave programming experience in Python, JavaScript, Go, Rust, or Haskell.\nHave practical experience applying CS and algorithms knowledge to build robust and scalable systems.\nHave a demonstrated record of working on and leading impactful projects.\n\nWhat we offer\nThe opportunity to work on challenging, high impact Bio infrastructure that is immediately deployed to accelerate the discovery of new therapeutics.\nStrong technical coworkers in software and biology, who all have a powerful mix of intellectual curiosity and humility. The team reads and discusses 1-2 ML or biology papers every week to stay on top of the field and inspire new ideas.\nCompetitive salary and equity. Medical, dental, and vision insurance.",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2740517873/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=pIK8ptVQYDf5sRWM0MJ5KQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nDuties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 2"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQH8CI9sHV5ZWA/company-logo_100_100/0/1625117356787?e=1641427200&v=beta&t=jdgNMXdjmH-hf0Dxtc7JGbtcBtmiiSA3E19yRYNlTNM",
    "link": "https://www.linkedin.com/jobs/view/2734432810/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=Pj1tZ0UifLFygqEiPWj6rA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Revature is a rapidly growing technology company that is focused on providing its Fortune 500 clients with the best software engineers in the country. Revature Software Engineers work with some of the top companies in the country, on projects that make a difference. \n We are looking for several passionate and ambitious Software Engineers to design, develop and install software solutions. The successful candidate will be able to build and support enterprise level applications in compliance with coding standards and technical design.\n\nRequired Skills:\nBA/BS in Computer Science, IS or related field\nThe passion and drive to expand your coding skills\nAbility to document requirements and specifications\nOutstanding verbal and written communication skills to effectively collaborate with team\nWorking knowledge of Object Oriented Programming\nExposure to one of the following programming languages: Java, C#, C++, SQL\nFamiliarity with software development methodology and release processes\nExcellent problem solver\nAbility to commit to work for Revature for a minimum of 2 years\nAbility to relocate anywhere within the US\nEligible to work in the US - ability to secure US government security clearance if needed\n\nResponsibilities:\n\n Execute full lifecycle software development\n Write well designed, testable, efficient code\n Integrate software components into a fully functional software system\n Develop software verification plans and quality assurance procedures\n Document and maintain software functionality\n Tailor and deploy software tools, processes and metrics\n Serve as a subject matter expert\n Comply with project plans and industry standards\n Benefits:\n\n·      Competitive Salary\n·      10 weeks of paid training\n·      Relocation Assistance \n·      Health, Vision & Dental Insurance\n·      Paid Time Off\n·      Industry Certifications\n·      Enterprise Level Application Development Training\n·      Life Insurance Policy\n·      401K\n\nLearn more about what life is like working at Revature by visiting our YouTube channel: http://bit.ly/2r8sXyD\n Suitable candidates are encouraged to apply immediately\n ",
    "title": "Entry Level Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C510BAQEKkNgp1pfLxg/company-logo_100_100/0/1519889070263?e=1641427200&v=beta&t=hWDSMI6gKHidJx4TIzzA1c8MW8vP1KyOqSqCEemeWXc",
    "link": "https://www.linkedin.com/jobs/view/2734491388/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=5QK8t%2B%2BUVuYnhDLayjd3TQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Are you looking for an opportunity to not just develop software, but to build a system that will have a direct and immediate positive impact? As a full-stack developer with Microsoft experience, you will modernize and automate critical business systems with a complete end-to-end solution in a fast-paced, agile environment. We’re looking for a software developer with the skills needed to build a modern corporate credit union platform.\n\nThis role is more than just development. We need full-stack developers who use their passion to learn new tools and techniques and identify and implement business process improvements. Using an Agile and Scrum development methodology in an as-a-Service approach, you’ll work with the development team to build a corporate credit union platform solution. This will require custom front-end development to optimize the member experience, as well as sophisticated data integration on the back-end. You’ll analyze the financial services industry to deliver solutions, as well as future functionality and enhancements. We offer an environment where ambitious, intelligent and talented people thrive. Join us and be part of the financial technology evolution.\n\nEssential Duties and Responsibilities\nResponsible for full stack development, testing, implementation, documentation, and maintenance of a wide variety of applications per business requirements; analyze the business environment to identify complex problems and recommend solutions\nDesign and develop new business software applications; support and create a variety of updates (maintenance, repairs bugs, etc.) for existing software applications\nIntegrate data from disparate systems to meet application requirements and ensure that applications are compatible across multiple computing platforms and browsers; provide support to end users and serve as a resource for colleagues\nRequired Knowledge, Skills, and Abilities\nKnowledge of and proficiency with VB.NET and C#, ASP.NET, HTML, JavaScript, Microsoft SQL Server, web services, API Integration, SOAP, and Object-Oriented software design\nExcellent time management, prioritization and organizational skills\nSolid verbal, written and interpersonal communication skills\nAbility to work well in a team environment and to effect positive initiatives\n\nEducation and Experience\nThis position requires a Bachelor’s degree in Computer Science or a related technical field. In lieu of degree, a minimum of five years of application development experience is acceptable. Experience in a financial services environment is preferred.",
    "title": "Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGLsQky344DwQ/company-logo_100_100/0/1531953193377?e=1641427200&v=beta&t=fqm4PS2fGUT5l2-u-_rzNLBmQMjAXuxEC8ZxH9LE1u4",
    "link": "https://www.linkedin.com/jobs/view/2736103078/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=2wWKxgZ4Huyz9ya8wu5LxQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Are you an experienced Developer who knows Zoho Deluge or can learn new languages quickly? Modern Mill Solar has an exciting opportunity for a mid-level developer who can bring at least 2-4 years of JavaScript/React development experience to help us evolve awesome applications for the Solar Industry.\n\nIdeal candidates can partner with internal and external team members as a strong collaborator to manage our development environments and code branches. The ability to translate business requirements into production code deliverables is key.\n\nPOSITION OVERVIEW\nThe Developer is a software engineer who will help take our cloud-based software to the next level of functionality and interactivity. Brings a cutting-edge design method to a fast-growing solar industry and want to help society transition to a more sustainable future.\n\nWHAT YOU'LL DO\nAct as a strong team player that is open to help from others and is willing to teach others.\nManage the development environments and code branches.\nDocument critical project information for their projects.\nTranslate business requirements into production code deliverables.\nExecute project deliverables from an Agile Backlog.\nCreate flowcharts and other documentation to identify requirements for software and to propose possible solutions.\nApply computer science, engineering, and mathematical analysis to the software development process.\nCommunicate with internal and external customers to establish documentation and maintenance procedures.\nManage updates, bug fixes, and release processes.\nCompletes all other duties as assigned.\n TECHNICAL EXPERTISE\n\nRequired\nProficiency with React JS\nProficiency in node.js\nProficiency with NoSQL and MySQL\n Preferred\nMeteorJS experience\nMongoDB experience\nZoho Deluge Scripting\nPHP experience\nLinux Server familiarity (any flavor)\nExperience with NginX and Apache\n WHAT ELSE YOU'LL BRING\nBachelor’s degree in Computer Science, Information Systems, Software Development, Mathematics, or related technical field, or three years’ relevant work experience equivalency preferred.\nExperience with data modeling, project management, and agile methodology.\nExcellent teamwork and communication skills.\nAbility to perform and thrive in a fast-paced environment.\n Modern Mills Solar is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age, or any other federally protected class.\n ABOUT MODERN MILL SOLAR\nAt Modern Mill, we provide energy solutions for every need under the sun.\n Our goal is to help customers harness the boundless energy of the sun, achieving energy freedom by strategically managing demanding and growing energy needs. Renewable, solar energy can work for nearly every home and business. Customers can take advantage of a 26% federal income tax rebate, state property tax exemptions (based on where you live), and a 50% one-time bonus depreciation. Our team helps make the cost savings and environmental benefits come alive for customers.\n\nBe a part of the energy revolution and apply today!\n\nOUR VALUES\nModern Mill Solar has eight core values that drive our business. These values are reflected in our employment practices and form the foundation for our employee and customer experiences.\nDemanding excellence\nBalanced living\nPioneering new ideas to solve existing problems\nThe simplest effective solution\nLiving with a sense of urgency\nA spirit of hospitality\nBeautiful designs\nActing with boldness and integrity",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQF03KPiXBETrw/company-logo_100_100/0/1627680596595?e=1641427200&v=beta&t=45qMzjNs5-4MGccF5k0nuQQNyNMJGl36JK084Pq5Q48",
    "link": "https://www.linkedin.com/jobs/view/2734833642/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=NCVHKIMM3mmh2ETPheiNyg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "WHO ARE WE?\n\nLooking for a job that makes a real difference in our world today and one that you’ll be proud of when you look back in 20, 30 or 40 years? This is it. Clean Power Research® is powering the energy transformation through cloud software that informs, streamlines and values energy-related decisions and processes for utilities, energy professionals and consumers.\n\nWe’re a growing company that counts 10 of the top 10 Fortune 500 utilities and many of the largest renewable energy companies in the U.S. as our customers. We’re focused on expanding our market reach and impact with new software technologies that help solve the energy industry’s hardest problems.\n\nAt Clean Power Research, every employee has a seat at the table and an important role.\n\nWHY WORK HERE?\nGo from building solutions to being part of the solution\nJoin a growing team of software and energy veterans from companies like Microsoft, Amazon, Google, Oracle, General Electric, Consolidated Edison and Pacific Gas & Electric\nBring your passion and ideas to the table\nUse your creativity to solve hard problems and make tough decisions\nWork in a start-up like environment coupled with the stability and customer base of an established, profitable company\nRealize work-life balance; we like to see our families, friends and pets at night!\nJoin a growing company that expects you to grow with us and invests in your growth\nClean Power Research offers competitive compensation and benefits to full-time employees including medical/dental/vision, paid vacation, paid holidays, a bonus plan and 401(k) plan with matching.\n\nJOB OVERVIEW\n\nWe’re adding a Software Engineer to our team to build innovative features for the new generation of our software platforms. This is a full-stack position where you’ll own entire features end-to-end. You’ll be using C#, JavaScript, JS frameworks and SQL in a cloud-hosted (AWS) environment. You’ll be part of an agile, empowered and high-performing team. You’ll have exposure to customers and the business, and be an important participant in product, design and technology decisions. Clean Power Research has several platforms and technologies to work on. \n  SolarAnywhere® – For this platform you will work with innovative software + science product that performs industry-leading solar prediction for the utility and solar markets. We start with near real-time satellite imagery and use sophisticated scientific algorithms to measure and forecast how much solar energy hits the ground. There are numerous markets for SolarAnywhere, including utility-scale forecasting and rooftop fleet operation.\n\nWattPlan® - For this team you will build innovative features for the new generation of our solar and DER (Distributed Energy Resources) analytics platform, WattPlan. WattPlan is an innovative web application and platform that helps consumers understand the costs and benefits of installing solar or adopting other distributed energy resources (DERs), such as electric vehicles, using a highly personalized analysis and sophisticated analytical models. WattPlan uses innovations such as integrated LIDAR rooftop data and detailed customer electric data from utilities to deliver the most personalized, detailed and accurate assessment in the world. WattPlan also includes a back-end analytics engine that is productized as a web services API that powers the renewable energy industry. \n\nPowerClerk® – This team provides application workflow automation to the utility and solar industries to drive down the soft cost of solar and other distributed energy resources. PowerClerk is already used by some of the largest utilities in the U.S. We have numerous bold bets and challenges ahead, including adding dramatic new capabilities to let us enter new markets and verticals.\n\nDUTIES AND RESPONSIBILITIES\nDelivering high-quality code and features with a high-degree of ownership\nParticipate in writing test automation (unit tests and integration tests) and be part of a combined engineering team\nCollaborate with other team members to define the product and make it great\nParticipate in release testing, monitoring of performance and functionality of the service in production\n\nQUALIFICATIONS\nvarious years of professional software development experience - all levels open, entry to Senior\nSomeone who has strong aptitude for problem solving and consistently delivers high quality code\nBA/BS or MS degree in Computer Science or related technical discipline\nExperience in building web applications/services using C#/ASP.NET/SQL and running in a cloud-hosted environment is a plus\nSomeone who has good communication skills, can clearly articulate complex issues and enjoys working and interacting directly with customers\nPassion for renewables is a plus\n\nHOW TO APPLY\nClick the link below to submit your resume. Please include a cover letter detailing your interest in this position and the renewable energy space along with your resume.? Due to the large number of applicants for our positions, we regret that we can only respond to candidates who meet our requirements.\n\nClean Power Research is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe company’s employment decisions are based on merit, competence, performance and business needs.",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQEA3GICl2-9Qg/company-logo_100_100/0/1625174577112?e=1641427200&v=beta&t=PZo2-UofBYbtCz8D7rephMIPWzrAhUy0vMc5LL954H8",
    "link": "https://www.linkedin.com/jobs/view/2734844668/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=lz6p3SOP4d%2FzMsV80OYxIQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Filevine is a fast-growing SaaS startup looking for an entrepreneurial minded software engineer to be apart of our growing development team. Filevine is a perfect stage to join because you can be a major player driving the direction and strategy of our growth. You will apply your knowledge of software architecture and development with a team of engineers building large features and innovation according to provided design specifications. Work will include building enhancements within an existing software stack, creating new features, and implementing improvements to the architecture.\n\nFilevine is pioneering a new way of managing complex requirements and tasks and driving a higher level of customer satisfaction by improving communications. In May of 2021, we acquired Outlaw which is an end-to-end, modern contract management solution that streamlines the contract lifecycle for organizations. Unlike other contract tools, Outlaw includes an advanced proprietary word processor which enables organizations to transform existing contracts into reusable templates that are error-free and seamlessly editable with dynamic legal logic built in. \n\nDo you want to imprint your code on our platform as we continue to scale? Then apply now!\n\n*100% flexibility to work remotely across the United States with a provided work station.*\n\nPrimary Duties and Responsibilities\nProvide expertise to the full stack development team by efficiently and productively:\nDeveloping web based applications using technologies such as NodeJS, Webpack, React, Firebase, ElasticSearch, GCP\nPerforming day to day maintenance and support of all existing applications in use at Outlaw\nPreserving and optimizing the quality of the software\nInnovating and improving on the software, features, processes, and technology\nAnalyzing, troubleshooting, and fixing issues and bugs as they arise\nPerforming detailed code reviews\nWork within the assigned team to complete duties as assigned, while mentoring and reviewing more junior engineers.\nBe part of an on-call rotation with other team members to provide escalated emergency support\nCommunicate frequently, clearly, and effectively with various technical and management audiences\n\nKnowledge and Skills\n4+ years working as a software engineer\nExpertise with JavaScript (ES6)\nExperience working with React, NodeJS and ExpressJS.\nExperience working with source control systems like GitHub\nAbility to work independently on assigned projects or with other team members as requested\nAbility to complete work assignments efficiently and productively\nStrong verbal and written communication skills\nKnowledge of the whole application development life cycle\n\nEducation\nB.S. in computer science, information systems, a related field; comparable certifications; or equivalent direct work experience",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEVb0ZISWk8vQ/company-logo_100_100/0/1519896425167?e=1641427200&v=beta&t=CGM7mahXAQ_eWvPwmDmdpnhYPL4ovkNWlTxoSgy6zAw",
    "link": "https://www.linkedin.com/jobs/view/2736028164/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=9T0dJVWug%2FjfURpb536oCQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Who are we?\n\nNetflix is the world's leading streaming entertainment service with over 209 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\n\nIf you have a passion for solving challenging problems, building scalable, robust systems; love working with the latest technologies in a fast-paced, agile environment; and are excited at the prospect of having a significant impact on software that over 209 million people use and love, then we want to talk to you.\n\nWho are you?\nNew Grad with a BS/BA in a technical field such as Computer Science, Engineering, Math, Statistics (Grad Date between Dec. 2021 & August 2022).\n1+ relevant internship experience or school project experience\nGreat problem-solving skills\nCurious and motivated learner\nClear communicator - you are concise and articulate in speech and writing\nCoursework or relative experience with data structures, algorithms, and debugging (Bonus if you’ve taken a course on distributed systems).\nPractical knowledge of Java or any other object-oriented programming language.\nWhat will you learn?\nBuild large-scale applications that solve complex business problems elegantly.\nDistributed system design and architecture process\nWriting high quality, performant, and industry-standard code\nWorking closely with business stakeholders in a fast-paced environment\nWhat we use today\nJava, Gradle, Spring Boot 2.x, gRPC, Atlas, Spinnaker, Elasticsearch, SQL, AWS, etc.\nNote that you don't need to know all of these right now, but you should be excited to learn them!\nNetflix is an equal opportunity employer that celebrates diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "title": "New Grad, Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2740505681/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=ULndaFH2YVyVjjcnKnEVXg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nOverview of Product: Oracle Analytics\n\nBe part of an energetic and challenging team building an enterprise Analytic platform that will allow users to quickly gain insights on their most valuable asset; data.\n\nOracle Analytics is an industry-leading product that empowers entire organizations with a full range of business analytics tools, enterprise ready reporting and engaging, and easy-to-use self-service data visualizations. Our customers are business users that demand a software product that allows easy, fast navigation through the full spectrum of data scale from simple spreadsheets to analyzing enormous volumes of information in enterprise class data warehouses.\n\nOracle Analytics is a comprehensive solution to meet the breadth of all analytics needs. Get the right data, to the right people, at the right time with analytics for everyone in your organization. With built-in security and governance, you can easily share insights and collaborate with your colleagues. By leveraging the cloud, you can scale up or down to suit your needs. The Oracle Analytics Cloud offering is a leading cloud service at Oracle built on Oracle Cloud Infrastructure. It runs with a Generation 2 offering and provides consistent high performance and unmatched governance and security controls.\n\nSelf-service analytics drive business agility with faster time to insights. You no longer need help from IT to access, prepare, analyze, and collaborate on all your data. Easily create data visualizations with automated chart recommendations and optimize insights by collaborating with colleagues on analyses.\n\nAugmented analytics with embedded machine learning throughout the platform drive smarter and better insights. Always on?and always working in the background, machine learning is continuously learning from the data it takes in, making it smarter and more accurate as time goes by. Uncover deeper patterns and predict trends for impactful, unbiased recommendations.\n\nOn the team we develop, deploy, and support the Oracle Analytics platform helping our customers succeed in their journey to drive business value. You will be working with experts in their field, exploring the latest technologies, you will be challenged while creating features that will be delivered to our customers, asked to be creative, and hopefully have some fun along the way. Members of our team are tasked to take on challenges along all aspect of our product.\n\nhttps://www.oracle.com/solutions/business-analytics\n\nAs a member of the development team, you will design, code, debug, and deliver innovative analytic features that involve Java, Javascript, Docker, Kubernetes and other Cloud technologies. You will work closely with your peer developers located across the world, including Mexico, China, India and the USA..\n\nKey Responsibilities\nDesign, develop, test and deliver new features on a world-class analytics platform suitable for deployment to both the Oracle Cloud and on-premise environments\nLead the creation of formal design specifications and coding of complex systems\nWork closely with the Product Management on product requirements and functionality\nParticipate in devops activities to maintain our fleet in Oracle Cloud\nContribute to automation and CI/CD framework using the OCI Tools\nWork with support team to address customer issues\nBuild software applications following established secure coding standards\nCommunicate continually with the project teams, explain progress on the development effort\nContribute to continuous improvement by suggesting improvements to software and deployment architecture or recommending new technologies\nEnsure quality of work through development standards and QA procedures\nPerform maintenance and enhancements on existing software\nKey Qualifications\nBS/MS in Computer Science or related major\nStrong written and verbal English communication skills\nSelf-motivated and passionate in developing high quality software\nBasic understanding of Agile/Scrum development methodologies\nDevops mindset to address real-time customer issues in production\nSolid understanding of object-oriented programming principles\nSolid skills utilizing one or more of object oriented languages - Java, Python\nStrong fundamentals and hands on experience working with containerization technologies such as Docker and Kubernetes\nKnowledge of Linux and Shell scripting\nHands-on experience using source control tools such as GIT and build technologies such as Maven/Gradle\nOther Qualifications\nKnowledge of Business Intelligence or Analytics\nFamiliarity with Cloud services such as OCI, AWS, Azure or GoogleCloud\nKnowledge of Software Development Lifecycle, Continuous Integration and Delivery tools\nKnowledge of Cloud Service lifecycle management\nKnowledge of relational databases\nKnowledge of Terraform\nKnowledge of Ansible\nKnowledge of JS frameworks such as ReactJS\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nProvide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.\n\nIf you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 124143 in the subject line of the email.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 5"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2741608428/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=Q2k8usZnqgmT1MpreaQo8A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.\n\nDuties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 3"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C510BAQFU7Hze3IiM_w/company-logo_100_100/0/1519869359474?e=1641427200&v=beta&t=ZGOZaJWzOJEE8CcWyNgHkcdO6SiWErOQAV7x7u_nyas",
    "link": "https://www.linkedin.com/jobs/view/2740271113/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=Qfaz5G0%2Bqm1CuTKwpil%2Bmw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description-\nAs a national leader in IT consulting, Rave Bizz is seeking professionals who want to accelerate their career opportunities. Through a 6-8 week training program, our hired consultants become full-time android mobile application development subject matter experts.\n \nUpon completion of the training course, you will have opportunities to travel across the U.S. to our mid-range to Fortune 500 clients, including GM, Washington post, Walmart and many more.\nLocation: Philadelphia, PA\nStart Date: 25th October (Android)\n \nOur company will provide… \n- Free, fully furnished corporate housing during training (Office Address - 104 S 20th St, Philadelphia, PA 19103, USA)\n- Free training materials and equipment for use during training and on projects.\n- Travel to and from training and clients’ project sites.\n- 2 weeks of hotel accommodations on each project.\n- Full W2 benefits packages including medical, dental, and vision insurance.\n- You will be paid during the Training of 6-8 weeks of the training period\n \nPROCESS: WHAT WILL I EXPERIENCE?\n \nOur Career Advancement Training (CAT) is interactive, innovative, and led by field-experienced trainers in our training facilities. \n- Each training day consists of 4-6 hours of hands-on application development followed by assignments to complete with training group team members.\n- Each trainee will receive coaching from experienced Rave Bizz Company technical experts who also provide 24/7 technical support during training and while on the project.\n- Each trainee will be assigned a dedicated Consultant Manager, who mentors and furthers each consultant’s professional development.\n- Weekly “How to Be a consultant” seminars focus on the non-technical aspects of the job.\nStart your new career!\n1.       Develop custom mobile applications using the android SDK.\n2.       Provide consulting services to our mid-range to Fortune 500 clients.\n3.       Contribute to the design, testing, and debugging of enterprise solutions.\n4.       Enhance your management, technical, design, and planning skills.",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_100_100/0/1625578658814?e=1641427200&v=beta&t=uJ1j3wYbl_8vFJsYZymWihQI-HQ0CGSEY8Wj5QGgU3Q",
    "link": "https://www.linkedin.com/jobs/view/2739080603/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=GMTuRfx9HmRgBfODJ8HJvg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Introduction\n\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\nYour Role and Responsibilities\n\nAs a member of a high-performing squad, you will design and develop content and agreement management software for the IBM Early Programs Web Tools team (EPWT). You will use and grow your java skills, as well as your understanding of Cloud and WebSphere technology, to implement new features and standards on EPWT as it keeps pace with the rapidly changing website industry. Since EPWT is an internal and external application your flexibility with website tooling design will be an asset.\n\nRequired Technical and Professional Expertise\n\n2 plus years' Java programming experience\n2 plus years’ experience with database technologies\n2 plus years’ experience with front end web development\nDemonstrated experience with cloud technologies\n\nPreferred Technical And Professional Expertise\n\nDemonstrated experience with WebSphere Liberty\n3 years’ software development experience\nExperience with db2 database technology\n\nAbout Business Unit\n\nIBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners.\n\nYour Life @ IBM\n\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\n\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\n\nBenefits\n\nIn addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to\n\nIBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.\n\n12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19.\nWorld-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals.\nWell-being programs to support mental and physical health.\nFinancial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.).\nSelect educational reimbursement opportunities.\nDiverse and inclusive employee resource groups where you can network and connect with IBMers across the globe.\nGiving and volunteer programs to benefit charitable organizations and local communities.\nDiscounts on retail products, services, and experiences.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nBeing You @ IBM\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n&CS",
    "title": "Full Stack Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_100_100/0/1625578658814?e=1641427200&v=beta&t=uJ1j3wYbl_8vFJsYZymWihQI-HQ0CGSEY8Wj5QGgU3Q",
    "link": "https://www.linkedin.com/jobs/view/2740412170/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=MCAelZGSeO%2Bj8v6VfjRW0g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Introduction\n\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\nYour Role and Responsibilities\n\nLocations: Austin, TX, Dallas, TX, and Houston, TX Preferred\n\nThe opening is for a highly skilled and efficient technical DevOps engineer that handles the day to day operations of the IBM Cloud Object Storage using ClevOS (Cleversafe).\n\nJob responsibilities include the coordination and completion of operation related activities, troubleshooting and service restoration on time and within budget and scope. Oversee all aspects of operations, sets priorities and deadlines, monitors and summarizes the progress of their project.\n\nThe successful candidate will work directly with his team and various teams within IBM Hybrid Cloud to ensure the stability and availability of the Cloud Object Storage offering.\n\nResponsibilities\n\nUse internal resources and third parties/vendors for the flawless execution of projects\nEnsure their assigned projects are delivered on-time, within scope and within budget\nAssist in the definition of project scope and objectives, involving all relevant stakeholders and ensuring technical feasibility\nMeasure project performance using appropriate tools and techniques\nReport and escalate to management as needed\nManage the relationship with the client teams and all stakeholders\nPerform risk management to minimize project risks\nEstablish and maintain relationships with third parties/vendors\nCreate and maintain comprehensive project documentation\nMeet with peer teams to take detailed ordering briefs and clarify specific requirements of each project\nTrack project performance, specifically to analyze the successful completion of short and long-term goals\nUse and continually develop leadership skills\nAttend conferences and training as required to maintain proficiency\nPerform other related duties as assigned\nDevelop spreadsheets, diagrams and process maps to document needs\n\nRequired Technical and Professional Expertise\n\n2+ years’ experience of development and maintenance of programs written in C/C++, Python, etc\n3+ years’ experience with Linux or Unix based OS\n2+ years’ experience working with cloud deployments and maintenance tools\nExperience working with Automation and Integration processes and tools: Ansible, Icinga, Jenkins\nGithub Enterprise and JIRA knowledge\nExperience working in an Agile/SCRUM-based environment\nExcellent client-facing communication skills (verbal and writing)\nSolid organizational skills including attention to detail and multitasking skills\n\nPreferred Technical And Professional Expertise\n\nExperience with Cleversafe (ClevOS) and/or other Cloud Object Storage\nHave worked with SoftLayer and Security projects\nExperience with cloud monitoring tools like: Kafka, Logstash, and/or ELK stack\nExperience with cloud computing technologies such as AWS, VMware, Azure, and/or SoftLayer\nIntegration experience with enterprise tools and back office systems is a big plus\nMaster’s degree in appropriate field of study or equivalent work experience\n\nAbout Business Unit\n\nDigitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics.\n\nYour Life @ IBM\n\nAre you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.\n\nEvery IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.\n\nIt's time to define your career.\n\nAbout IBM\n\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\n\nBenefits\n\nIn addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to\n\nIBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.\n\n12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19.\nWorld-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals.\nWell-being programs to support mental and physical health.\nFinancial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.).\nSelect educational reimbursement opportunities.\nDiverse and inclusive employee resource groups where you can network and connect with IBMers across the globe.\nGiving and volunteer programs to benefit charitable organizations and local communities.\nDiscounts on retail products, services, and experiences.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nBeing You @ IBM\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "title": "Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C510BAQFU7Hze3IiM_w/company-logo_100_100/0/1519869359474?e=1641427200&v=beta&t=ZGOZaJWzOJEE8CcWyNgHkcdO6SiWErOQAV7x7u_nyas",
    "link": "https://www.linkedin.com/jobs/view/2734843369/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=QBLHzfyUZfsMCpq0CAXX%2Fw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description-\n\nAs a national leader in IT consulting, Rave Bizz is seeking professionals who want to accelerate their career opportunities. Through a 6–8-week training program, our hired consultants become full-time mobile application development subject matter experts within a matter of months.\n With Rave Bizz Company and our carefully structured, intensive, free training program in android mobile application development, you will start a new career in 6-8 weeks. Upon completion of the training course, you will have opportunities to travel across the U.S. to our mid-range to Fortune 500 clients, including Home Depot, Washington post, General Motors and many more.\n \nLocation: Philadelphia, PA\nStart Date: 25th October\n Our company will provide…\n- Free, fully furnished corporate housing during training (Office Address - 104 S 20th St, Philadelphia, PA 19103)\n- Free training materials and equipment for use during training and on projects.\n- Travel to and from training and clients’ project sites.\n- 2 weeks of hotel accommodations on each project.\n- Full W2 benefits packages including medical, dental, and vision insurance.\n- You will be paid during the Training of 6-8 weeks of the training period\n PROCESS: WHAT WILL I EXPERIENCE?\nOne of Rave Bizz Company’s business focuses is the success of each and every single one of our consultants. We have honed our processes to provide an exceptional level of support and development.\n Streamlined 3-step interviewing process\n1. Skype Technical Interview- 60 minutes of an interview conducted via Skype audio call; will include coding questions and live coding from an SME.\n2. Second Round of Interview- 30 minutes of Skype video call with the Instructor/Trainer.\n3. Final Round of Interview- 30 minutes of a telephonic call with the founder/president of the company.\n\nOur Career Advancement Training (CAT) is interactive, innovative, and led by field-experienced trainers in our training facilities.\nDid we mention we will be paying you for 40 hours/week for training?!\n- Each training day consists of 4-6 hours of hands-on application development followed by assignments to complete with training group team members.\n- Each trainee will receive coaching from experienced Rave Bizz Company technical experts who also provide 24/7 technical support during training and while on the project.\n- Each trainee will be assigned a dedicated Consultant Manager, who mentors and furthers each consultant’s professional development.\n- Weekly “How to Be a consultant” seminars focus on the non-technical aspects of the job.\n\nStart your new career!\n1.   Develop custom mobile applications using the Android SDK.\n2.   Provide consulting services to our mid-range to Fortune 500 clients.\n3.   Contribute to the design, testing, and debugging of enterprise solutions.\n4.   Enhance your management, technical, design, and planning skills.\n\nLet me know if you are interested in this or if you have my questions for us.",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEp8IZ2oEGxKA/company-logo_100_100/0/1593624241969?e=1641427200&v=beta&t=akvOpKN6nVnChYM04vBzmDmqR-mEsq2s3XQW4YS0sFk",
    "link": "https://www.linkedin.com/jobs/view/2740885786/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=oQXZECCB%2BZ7wZlYjyKOQjQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nFidelity Personal Investing – Client Solutions Technology Chapter Area is looking for a hardworking Full Stack Senior Software Engineer to build and support world-class products for its business critical Planning and Advice Platform Tribe. Our engineering team is innovative, diverse, passionate and self-driven. We work in a very dynamic agile environment.\n\nAs a senior engineer on the team, your primary role will be building, testing and engineering webservices using modern technologies like REST APIs, Java, Spring etc. You will be expected to quickly gain understanding of all the components of our web applications and will work with the team to deliver best in class solutions.\n\nOur ever-evolving technology stack ensures a great learning culture in the team. We are always exploring new technologies and new ways to continually provide value to our customers. This team has a direct and positive impact on Fidelity’s customers.\n\nThe Expertise You Have\nBachelor's degree in Computer Science or Engineering\n2+ years of development experience (currently hands on) in Java, Spring MVC / Spring Core / Web Services (SOAP/REST) and configuring web containers.\n1+ years of Responsive & Progressive Modern Web application development.\nWell versed and comfortable with Math/Solid math background\nMake significant contributions to our technology platform\nDesign patterns, UML\nTest Driven Development, Junit, Jasmine, Karma\nIDE’s Spring Tool Suite, and Eclipse, within a UNIX and Windows environment.\nApplication build, deploy using Continuous Integration/ Deployment (CI/CD) tools -- Jenkins, Maven, uDeploy, etc.\nWriting SQL queries and debugging stored procedures within an Oracle environment.\nLeadership: Standout colleague, self-starter, collaborative, innovative, eager to learn every day.\nScrum Developer certification is a plus\nUnderstanding of docker, cloud-computing / cloud services platforms (e.g. AWS or azure) will be a plus\n\nResponsibilities\nAssist in coordinating multiple development work streams through integration and ensure architecture is scalable and extensible.\nDefine, maintain, and support Java development environment and standard methodologies, such as Maven, Sonar, and other Open Source tools.\nAssist in identification, isolation, resolution, and communication of problems within the production and nonproduction environment and perform troubleshooting.\nPerform code reviews, unit testing, and integration testing using Open Source frameworks.\nProvide mentorship to junior team members.\nContribute to continuous process improvement initiatives.\n\nThe Value You Deliver\nUnderstand the leadership vision and execute on that vision.\nHelp strengthen further the culture of innovation by setting examples\nFind creative ways to get things done, and do them right\nFoster a culture of best in class software engineering practices\nExercise a passion for keeping your knowledge up-to-date with the latest and greatest\nHelp maintain the high level of integrity in the team\nTake ownership and accountability for figuring out what needs to be done\n\nCertifications\n\nCompany Overview\n\nAt Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: to strengthen the financial well-being of our clients. We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.\n\nJoin Us\n\nAt Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities.\n\nWe invite you to Find Your Fidelity at fidelitycareers.com.\n\nFidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.\n\nFidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
    "title": "Software Engineer Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2744343363/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=m3tK7acWQkd3eJEXLBwVVQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nOracle Cloud Infrastructure - Data Science\n\nMember of Technical StaffThe Oracle Cloud Infrastructure (OCI) team can provide you the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment. OCI is committed to providing the best in cloud products that meet the needs of our customers who are tackling some of the world’s biggest challenges.\n\nWe offer unique opportunities for smart, hands-on engineers with the expertise and passion to solve difficult problems in distributed highly available services and virtualized infrastructure. At every level, our engineers have a significant technical and business impact designing and building innovative new systems to power our customer’s business critical applications.\n\nThis role is available on the OCI Data Science service. We are addressing exciting challenges at the intersection of data science and cutting-edge infrastructure. We are building a cloud service for data scientists, machine learning engineers and software engineers to help them every step of the way in their machine learning development and deployment lifecycle. Our product vision includes interactive notebooks, distributed machine learning on CPU/GPU supporting wide variety of ML algorithms/libraries, distributed model serving and robust monitoring and analytics of ML models.As a Machine Learning Engineer on the Oracle Cloud Infrastructure Data Science team, you will have a hand in the design and delivery of a high-quality cloud service with the capabilities, scalability and performance needed to match the needs of enterprise data science teams and enterprise application development teams. You will need experience with designing and developing software for machine learning solutions - solving real-world business problems.What You'll Do\nBuild accelerated data science components and machine learning solutions for a cloud service on top of the modern Infrastructure as a Service (IaaS) building blocks at OCI\nParticipate in the entire software lifecycle – development, testing, CI and production operations\nDevelop new features for the data science platform in a variety of classical and deep learning frameworks\nWork with customers and ISVs to troubleshoot data science solutions in data wrangling, data access, training models and putting them into production\nDesign, Develop and Document robust software components with mentorship and guidance from others in your team\nParticipate in on-call for the service with the team\nQualifications\n2+ years of professional work experience\nDevOps Experience/Familiarity: Containerization (Dockerizing python), Linux/UNIX Shell, package management/Conda etc\nB.S., M.S. in Computer Science, Electrical Engineering, or software relevant field, CS, EE etc\nUnderstanding of machine learning (training will also be provided)\nDemonstrated programming abilities in Python\nExperience with software coding practices (unit tests, mock, logging, debugging, git, code review, etc)\nMeets/exceeds Oracle's functional/technical depth and complexity for this role\nStrong verbal and written communication skills\nCloud Experience with AWS, GCP, Azure, Heroku etc. highly desirable\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nDuties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 2"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEYK67Tel_mng/company-logo_100_100/0/1624162747433?e=1641427200&v=beta&t=_1Rt63YaFVVrzh64BeVCdGni8sjaaE0JZvA3xLoSjlM",
    "link": "https://www.linkedin.com/jobs/view/2741606741/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=DM2%2BqTusot1CnWoQCYHpmg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, RevCare, is seeking the following. Apply via Dice today!\n\nJunior Software Developer Job Summary We are seeking an entry-level team player to join our team as a Junior Software Developer. Once you gain more experience and build up your programming skills, you will start to take on larger projects. The ideal candidate must be able to work on-site in our Fairlawn, OH office and have a knack for problem solving, the ability to work well in a team environment, and be able to quickly learn how to develop enterprise level software that focuses on web and back-office solutions. This position works with a team of experienced software professionals who will enable you to kick off a successful career developing custom software solutions for our distributorscustomers. Job Responsibilities Coding, testing, deploying, and maintaining software solutions Contributing to an entrepreneurial, positive team culture Review tasks, gather requirements, and complete tasks focused on software development Learn the codebase, work on small bug fixes, and participate in paired programming with med-level and senior developers Attending and contributing to development team meetings Troubleshooting Patching computer code Collaborating with other developers to create applications Design report layouts and determine the best way to offer data to end users Implement business processes on report development and maintenance Gathering data using SQL Ontario Reports Minimum Qualifications Education andor experience with Microsoft Technology Stack .NET Framework .NET Core SOAP REST Service Architecture C Language Education andor experience with Web Development Technologies ASP Java Script Bootstrap JQuery Preferred Education andor experience with Microsoft SQL Server TSQL Language Stored Procedures Views Functions Exceptional verbal and written communication skills. Ability to troubleshoot and solve software and hardware challenges. Ability to work well in a team environment.",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2740506973/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=vqPGBiCohvlKMLIQ2%2FWKWg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 5"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2740510480/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=oSHPs%2BUY8RtkTEE05W1Q6g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nJob Description\n\nThe Oracle Cloud Infrastructure (OCI) team can provide you the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment. OCI is committed to providing the best in cloud products that meet the needs of our customers, who are tackling some of the world's biggest challenges.\n\nWe offer unique opportunities for innovative, hands-on engineers with the expertise and passion for solving complex problems in distributed, highly available services and virtualized infrastructure. Our engineers have a significant technical and business impact at every level, designing and building innovative new systems to power our customer's business-critical applications. Oracle's Infrastructure Cloud Object Storage team is Hiring Software Engineers, a level commensurate with demonstrated achievements in the past and experience.\n\nThe object store team is building a performant, scalable, highly available, and durable object store from the ground up. You will be part of a team founded by industry veterans from AWS, Google, Azure, Dropbox, and others. We believe this team and its mission sit squarely at the center of Oracle's future and are an integral part of Oracle's next-generation public cloud efforts.\n\nWe have engineering work at every stack layer, from REST APIs to distributed systems to file systems. We are looking for teammates interested in being part of a team that innovates from top to bottom. We believe that the only way to succeed is to own every aspect of the problem, so we are creating a team that controls its destiny. You will own the development of new components and features, from initial concepts through design, implementation, test, and operation. Your intelligence and expertise will result in a sense of accomplishment as you create new features and oversee their use by customers in a production environment.\n\nResponsibilities\nWork with senior architects and product management to define requirements\nDesign and implement new features\nDefine and guide engineering processes and procedures\nReview code written by your peers to ensure correctness and fit with the team's overall design principles\nWork with the team to operate services that host massive amounts of data\nMinimum Qualifications\nBS in Computer Science; level commensurate with years of experience\nProven experience with a major Object Oriented Programming language such as Java or C++\nDeep understanding of data structures and design patterns\nBackground in building, testing, and debugging robust production services\nDeep understanding of standard architectures for Distributed System\nExcellent written and verbal communication\nStrong troubleshooting and performance tuning skills.\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. In addition, you will be responsible for defining and developing software for tasks associated with the developing, designing, and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving applying advanced technical/business skills in the area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\nIf you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 123641 in the subject line of the email.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 4"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEYK67Tel_mng/company-logo_100_100/0/1624162747433?e=1641427200&v=beta&t=_1Rt63YaFVVrzh64BeVCdGni8sjaaE0JZvA3xLoSjlM",
    "link": "https://www.linkedin.com/jobs/view/2741476471/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=gfzIxpSnLfEMKYD8uWYKgA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Vaco Technology, is seeking the following. Apply via Dice today!\n\nVaco Technology has an immediate need for a Junior-Midlevel Software Developer for a permanent position in Memphis, TN. Requirements Min 1 year of development experience C.Net or Java is preferred but willing to consider other programming languages Solid understanding of web services Experience with Angular OR React preferred US citizens and those authorized to work in the US are encouraged to apply. We are unable to sponsor H1B candidates at this time.",
    "title": "Junior-Midlevel Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEJ7w_5R6CAIg/company-logo_100_100/0/1622745648084?e=1641427200&v=beta&t=eA5mSlOWkszf9TdLtrAdvMDJefW4dXjPPoDSEYNdvUo",
    "link": "https://www.linkedin.com/jobs/view/2744346767/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=GPBfNXlPnEOtIGTBua843w%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Are you a motivated and driven person who wants to build a Developer career with an innovative, fast-growing startup? We are here to make a big impact, and we’re looking for team members to help achieve our goals by building an amazing financial product. The Back-End Developer is a key member of the Engineering team. This role is a prime creator of First Boulevard’s back-end financial product infrastructure.\n\nWhat you will do at First Boulevard:\nReviews the requirements and identifies concerns prior to writing code.\nProvides estimates and design spec feedback.\nWrites clear, concise, and well-documented code.\nDevelops solutions that encompass front-end, application layer, and back-end databases.\nCollaborates with other developers to enhance the user experience.\nWorks closely with Product Managers to understand use cases and user needs.\nDevelops responsive products which render seamlessly across multiple devices.\nProduces technical design documentation.\n\nRequirements:\n2-5 years of release management and/or project management experience.\nExperience with building scripts and using scripting tools.\n2-5 years experience with AWS code build and code deploy pipeline.\nExcellent communication skills.\nExperience with Agile software development lifecycle.\nExperience with Git or similar source code repository.\nKnowledge in code branching strategies.\nStrong knowledge of data structures and system design.\nExperience building solutions on AWS services (Lambda, Codepipeline, etc.).\nExpertise Java or other JVM-based languages.\nAble to create reliable and performant code.\nExperience working in an agile development environment (Agile, Scrum, or Kanban preferred).\nProactive and self-motivated.\nStrong independent worker and team contributor.\nStrong communication skills, both verbal and written.\nBS Computer Science background preferred.\nStartup experience preferred.\n\nBonus:\nFintech experience.\nDevOps experience.\nWorked with Clojure in past projects.\n\n***WHEN APPLYING, PLEASE COMPLETE THE APPLICATION QUESTIONS IN FULL IN ORDER TO BE CONSIDERED FOR THIS ROLE***\n\nWhy join the First Boulevard team?\nFirst Boulevard is working hard to build generational wealth for our Black community. Work for a company that walks their talk! Our team members enjoy competitive compensation and a generous benefits package, including:\nHigh-quality, comprehensive Aetna medical plans. The company pays 100% insurance premiums for employees, and 75% of premiums for spouse and family.\nDental and vision insurance.\nMeaningful equity via stock options.\nFlexible vacation plan and 10 paid holidays.\nWellness program.\nAdvancement opportunities with a fast-growing company.\nWe are an Equal Opportunity Employer.",
    "title": "Back End Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1641427200&v=beta&t=DWotxOEOK77zGOhmra17rIVK-YA_Ry8lyEtyjOk975c",
    "link": "https://www.linkedin.com/jobs/view/2744343259/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=t%2BM9Mu67Otwa6Jqnj%2B7hQw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nAre you interested in building large-scale distributed infrastructure for the cloud?\n\nOracle’s Cloud Infrastructure team is building new File Storage Services that operate at high scale in a broadly distributed multi-tenant cloud environment. Our customers run their businesses on our cloud, and our mission is to provide them with best in class file storage capabilities in conjunction with other compute, storage, networking, database, security offerings.\n\nWe’re looking for hands-on engineers with a passion for solving difficult problems in distributed systems, virtualized infrastructure, and highly available services. If this is you, at Oracle you can design and build innovative new systems from the ground up and operate services at scale. Engineers at every level can have significant technical and business impact while delivering critical enterprise level features.\n\nAs a Member of Technical Staff you will work as a member of a highly collaborative team building new features for File Storage Service and operating and growing the current service offering. You should understand distributed systems, be able to architect broad systems interactions, while being very hands-on, able to dive deep into any part of the stack and lower level system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.\n\nQualifications\n\nA minimum of 1 year experience developing commercial software in a distributed environment.\n\nStrong knowledge of Java, Go or C++.\n\nStrong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals.\n\nStrong understanding of databases, storage and persistent technologies.\n\nStrong troubleshooting, debugging and performance tuning skills\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nDuties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 2"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQHpXZDZYImrdA/company-logo_100_100/0/1542647676208?e=1641427200&v=beta&t=X_no2kRNQe8-RhzdP-MQCK5Xgtiw43czdgCA7mKWRWM",
    "link": "https://www.linkedin.com/jobs/view/2741245496/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=kwFHhv6cWUEWiX0cBMG%2Fjw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nAt Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\n\nThe Boeing Company is currently seeking Entry-Level Simulation/Lab Software Engineers to start a career with a team where Software really matters. We are seeking college graduates to work on a variety of exciting opportunities with simulation/lab products. If you come to work with us you will be responsible for full life-cycle software development which means you will have a hand in defining the requirements; designing, implementing and testing the software; and supporting these products through delivery and in the field.\n\nThis entry level role is based out of our Berkeley, Missouri campus.\n\nThe selected applicant will be a member of a high performing, collaborative team and must be self-motivated with a strong work ethic, excellent time-management, and interpersonal skills. These teams use Agile methodologies to support all aspects of product development, including project management. The applicant will be encouraged to actively help the team continuously improve and develop innovative and creative solutions to products and processes.\n\nKey responsibilities could include:\n\nSoftware Algorithm Development.\nSoftware development, modeling, simulation, testing, and/or analysis using C++, C#, Python, Windows, and Linux.\nWorking with customers and other engineers to define requirements, such as understanding and agreeing upon the function of software system.\nArchitect and designing software to meet current and future requirements.\nImplementing software using a variety of technologies and implementation software languages.\n\nThis position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. An interim and/or final U.S. Secret Clearance Post-Start is required.\n\nBasic Qualifications (Required Skill/Experience):\n\nBachelor’s degree or greater in a technical field of study.\n\nPreferred Qualifications (Desired Skills/Experience):\n\n1 or more years of experience with C, C++, C#, or Java.\n1 or more years working in Agile software development framework.\n1 or more years of experience with real-time embedded software development.\nFamiliar working with and/or developing software requirements/test methodology.\n\nTypical Education/Experience:\n\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) or an equivalent combination of technical education and experience. In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nRelocation:\n\nThis position offers relocation based on candidate eligibility.\n\nDrug Free Workplace:\n\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nShift:\n\nThis position is for 1st shift.",
    "title": "Entry-Level Simulation/Lab Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQG5-kCVBr6h7w/company-logo_100_100/0/1619700976034?e=1641427200&v=beta&t=U2KgUOrVZkSfk8b23k71U2RY0NCrOD762ytdlllAKPE",
    "link": "https://www.linkedin.com/jobs/view/2740414872/?alternateChannel=search&refId=jh5UOFwczNQcwfx5DCKauw%3D%3D&trackingId=6yyrIjBi5XRtodfRtO5gpg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Company: FedEx Services\n\nJob Title: Software Developer I\n\nJob Requisition Number: RC428328\n\nCategory: Information Technology\n\nPay Type: Exempt\n\nLocations:\n\nOrlando, Florida 32810\n\nUnited States\n\nUnder close supervision, Ensures application of systems thinking principles, allowing team members to independently design, code, test, and deploy software. Provide the necessary documentation to support the software Development Life Cycle. Develop prototypes and solutions leveraging a diverse range of technology. Apply modern principles, methodologies, tools, and systemic processes to support the launch new business capabilities.\n\nDomicile: This position will be domiciled in Orlando, Florida.\n\nRemote Work: The ability to work remotely within the United States may be available based on business need.\n\nRelocation: Relocation assistance may be available based on business need.\n\nNotice: Sponsorship for this position is not available for new hires.\n\nMinimum Qualifications\n\nBachelor’s degree in computer science, engineering or information systems OR\n\nFormal completion of a bootcamp certification and two years work experience in operations, business or technical field OR\n\nBachelor’s degree and formal completion of a bootcamp certification OR\n\nBachelor’s degree and two years work experience in technical field.\n\nApplication Criteria: To be considered, please upload a copy of your current resume to include beginning and ending dates for each employer/position and answer job screening questionnaire by close of business (5:00 PM CST) on Thursday, October 7, 2021.\n\nFedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.\n\nFedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com.",
    "title": "Software Developer I"
}]